In [1]:
import pandas

In [5]:
#pip install pandas

In [6]:
import pandas as pd

In [7]:
df =pd.DataFrame()
type(df)

pandas.core.frame.DataFrame

In [8]:
!jupyter --version

Selected Jupyter core packages...
IPython          : 7.31.1
ipykernel        : 6.15.2
ipywidgets       : 7.6.5
jupyter_client   : 7.3.4
jupyter_core     : 4.11.1
jupyter_server   : 1.18.1
jupyterlab       : 3.4.4
nbclient         : 0.5.13
nbconvert        : 6.4.4
nbformat         : 5.5.0
notebook         : 6.4.12
qtconsole        : 5.2.2
traitlets        : 5.1.1

In [9]:
series = pd.Series()
type(series)

C:\Users\FAHAD\AppData\Local\Temp\ipykernel_9240\4201248518.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  series = pd.Series()

pandas.core.series.Series

In [14]:
l=[1,2,3,4,5,'a','y']
series = pd.Series(l,index=['a','b','c','d','e','f','g'])
type(series)

pandas.core.series.Series

In [15]:
series

a    1
b    2
c    3
d    4
e    5
f    a
g    y
dtype: object

In [23]:
dict1={'a':1,'b':2,'c':3,'d':4,'e':5}

In [24]:
series1=pd.Series(dict1)
series1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [25]:
df=pd.DataFrame()
df['Age']=[12,43,56,45]
df['gender']=['M','M','F','F']

In [26]:
df

   Age gender
0   12      M
1   43      M
2   56      F
3   45      F

In [31]:
df1=pd.DataFrame([12,43,56,45],index=['a','b','c','d'],columns=['age'])
#df1['Age']=[12,43,56,45]
#df1['gender']=['M','M','F','F']

In [33]:
df1

   age
a   12
b   43
c   56
d   45

In [41]:
dict1={'a':1,'b':2,'c':5,'d':8}
df=pd.DataFrame(dict1,index=['a'])

In [42]:
df

   a  b  c  d
a  1  2  5  8

In [83]:
df=pd.DataFrame([[12,'M',94],[43,'M',78],[56,'F',67],[45,'F',83]],index=['a','b','c','d'],columns=['age','gender','score'])
df

   age gender  score
a   12      M     94
b   43      M     78
c   56      F     67
d   45      F     83

In [84]:
df['gender']=='M'
#df=df.drop(['c'],axis=0)
df

   age gender  score
a   12      M     94
b   43      M     78
c   56      F     67
d   45      F     83

In [90]:
#df[df['gender']=='M']
#df[df['gender']=='F']
#df[df['score']>80]
df[(df['score']>80) & (df['gender']=='F')]

   age gender  score
d   45      F     83

In [80]:
df=df.drop(['score','gender'],axis=1)

In [61]:
df

   age
a   12
b   43
d   45

In [106]:
df=pd.DataFrame([[12,'M'],[43,'M'78],[56,'F',67],[45,'F',83]],index=['a','b','c','d'],columns=['age','gender','score'])
df

   age gender  score
a   12      M     94
b   43      M     78
c   56      F     67
d   45      F     83

In [109]:
df.iloc[1:4,1:2]

  gender
b      M
c      F
d      F

In [103]:
df.loc[['b','c'],'gender']

b    M
c    F
Name: gender, dtype: object

In [1]:
df.drop_duplicate()

NameError: name 'df' is not defined